#mod by Anonumyc Economy Team.

from .. import loader, utils
from asyncio import sleep


def register(cb):
    cb(LoadingMod())


class LoadingMod(loader.Module):
    """Loading"""
    strings = {'name': 'ЗагрузОчка'}

    async def loadingcmd(self, message):
        """Загрузка 1"""
        await message.edit("|█\nLoading: 5% [#...................]")
        await sleep(0.25)
        await message.edit("|█\n"
                           "|██\nLoading: 10% [##..................]")
        await sleep(0.25)
        await message.edit("|█\n"
                           "|██\n"
                           "|███\nLoading: 15% [###.................]")
        await sleep(0.25)
        await message.edit("|█\n"
                           "|██\n"
                           "|███\n"
                           "|████\nLoading: 20% [####................]")
        await sleep(0.25)
        await message.edit("|█\n"
                           "|██\n"
                           "|███\n"
                           "|████\n"
                           "|█████\nLoading: 25% [#####...............]")
        await sleep(0.25)
        await message.edit("|█\n"
                           "|██\n"
                           "|███\n"
                           "|████\n"
                           "|█████\n"
                           "|██████\nLoading: 30% [######..............]")
        await sleep(0.25)
        await message.edit("|█\n"
                           "|██\n"
                           "|███\n"
                           "|████\n"
                           "|█████\n"
                           "|██████\n"
                           "|███████\nLoading: 35% [#######.............]")
        await sleep(0.25)
        await message.edit("|█\n"
                           "|██\n"
                           "|███\n"
                           "|████\n"
                           "|█████\n"
                           "|██████\n"
                           "|███████\n"
                           "|████████\nLoading: 40% [########............]")
        await sleep(0.25)
        await message.edit("|█\n"
                           "|██\n"
                           "|███\n"
                           "|████\n"
                           "|█████\n"
                           "|██████\n"
                           "|███████\n"
                           "|████████\n"
                           "|█████████\nLoading: 45% [#########...........]")
        await sleep(0.25)
        await message.edit("|█\n"
                           "|██\n"
                           "|███\n"
                           "|████\n"
                           "|█████\n"
                           "|██████\n"
                           "|███████\n"
                           "|████████\n"
                           "|█████████\n"
                           "|██████████\nLoading: 50% [##########..........]")
        await sleep(0.25)
        await message.edit("|█\n"
                           "|██\n"
                           "|███\n"
                           "|████\n"
                           "|█████\n"
                           "|██████\n"
                           "|███████\n"
                           "|████████\n"
                           "|█████████\n"
                           "|██████████\n"
                           "|███████████\nLoading: 55% [###########.........]")
        await sleep(0.25)
        await message.edit("|█\n"
                           "|██\n"
                           "|███\n"
                           "|████\n"
                           "|█████\n"
                           "|██████\n"
                           "|███████\n"
                           "|████████\n"
                           "|█████████\n"
                           "|██████████\n"
                           "|███████████\n"
                           "|████████████\nLoading: 60% [############........]")
        await sleep(0.25)
        await message.edit("|█\n"
                           "|██\n"
                           "|███\n"
                           "|████\n"
                           "|█████\n"
                           "|██████\n"
                           "|███████\n"
                           "|████████\n"
                           "|█████████\n"
                           "|██████████\n"
                           "|███████████\n"
                           "|████████████\n"
                           "|█████████████\nLoading: 65% [#############.......]")
        await sleep(0.25)
        await message.edit("|█\n"
                           "|██\n"
                           "|███\n"
                           "|████\n"
                           "|█████\n"
                           "|██████\n"
                           "|███████\n"
                           "|████████\n"
                           "|█████████\n"
                           "|██████████\n"
                           "|███████████\n"
                           "|████████████\n"
                           "|█████████████\n"
                           "|██████████████\nLoading: 70% [##############......]")
        await sleep(0.25)
        await message.edit("|█\n"
                           "|██\n"
                           "|███\n"
                           "|████\n"
                           "|█████\n"
                           "|██████\n"
                           "|███████\n"
                           "|████████\n"
                           "|█████████\n"
                           "|██████████\n"
                           "|███████████\n"
                           "|████████████\n"
                           "|█████████████\n"
                           "|██████████████\n"
                           "|███████████████\nLoading: 75% [###############.....]")
        await sleep(0.25)
        await message.edit("|█\n"
                           "|██\n"
                           "|███\n"
                           "|████\n"
                           "|█████\n"
                           "|██████\n"
                           "|███████\n"
                           "|████████\n"
                           "|█████████\n"
                           "|██████████\n"
                           "|███████████\n"
                           "|████████████\n"
                           "|█████████████\n"
                           "|██████████████\n"
                           "|███████████████\n"
                           "|████████████████\nLoading: 80% [################....]")
        await sleep(0.25)
        await message.edit("|█\n"
                           "|██\n"
                           "|███\n"
                           "|████\n"
                           "|█████\n"
                           "|██████\n"
                           "|███████\n"
                           "|████████\n"
                           "|█████████\n"
                           "|██████████\n"
                           "|███████████\n"
                           "|████████████\n"
                           "|█████████████\n"
                           "|██████████████\n"
                           "|███████████████\n"
                           "|████████████████\n"
                           "|█████████████████\nLoading: 85% [#################...]")
        await sleep(0.25)
        await message.edit("|█\n"
                           "|██\n"
                           "|███\n"
                           "|████\n"
                           "|█████\n"
                           "|██████\n"
                           "|███████\n"
                           "|████████\n"
                           "|█████████\n"
                           "|██████████\n"
                           "|███████████\n"
                           "|████████████\n"
                           "|█████████████\n"
                           "|██████████████\n"
                           "|███████████████\n"
                           "|████████████████\n"
                           "|█████████████████\n"
                           "|██████████████████\nLoading: 90% [##################..]")
        await sleep(0.25)
        await message.edit("|█\n"
                           "|██\n"
                           "|███\n"
                           "|████\n"
                           "|█████\n"
                           "|██████\n"
                           "|███████\n"
                           "|████████\n"
                           "|█████████\n"
                           "|██████████\n"
                           "|███████████\n"
                           "|████████████\n"
                           "|█████████████\n"
                           "|██████████████\n"
                           "|███████████████\n"
                           "|████████████████\n"
                           "|█████████████████\n"
                           "|██████████████████\n"
                           "|███████████████████\nLoading: 95% [###################.]")
        await sleep(0.25)
        await message.edit("|█\n"
                           "|██\n"
                           "|███\n"
                           "|████\n"
                           "|█████\n"
                           "|██████\n"
                           "|███████\n"
                           "|████████\n"
                           "|█████████\n"
                           "|██████████\n"
                           "|███████████\n"
                           "|████████████\n"
                           "|█████████████\n"
                           "|██████████████\n"
                           "|███████████████\n"
                           "|████████████████\n"
                           "|█████████████████\n"
                           "|██████████████████\n"
                           "|███████████████████\n"
                           "|████████████████████\nLoading: 100% [####################]")
        await sleep(2)
        await message.edit("ЗагрузОчка завершина! Так-с твою саньё дало анализы. Пишут что ты: Пидор!")


    async def loading2cmd(self, message):
        """Загрузка 2"""
        await message.edit("ЗагрузОчка: 0% [....................]")
        await sleep(2)
        await message.edit("ЗагрузОчка: 5% [#...................]")
        await sleep(0.5)
        await message.edit("ЗагрузОчка: 10% [##..................]")
        await sleep(0.5)
        await message.edit("ЗагрузОчка: 15% [###.................]")
        await sleep(0.5)
        await message.edit("ЗагрузОчка: 20% [####................]")
        await sleep(0.5)
        await message.edit("ЗагрузОчка: 25% [#####...............]")
        await sleep(0.5)
        await message.edit("ЗагрузОчка: 30% [######..............]")
        await sleep(0.5)
        await message.edit("ЗагрузОчка: 35% [#######.............]")
        await sleep(0.5)
        await message.edit("ЗагрузОчка: 40% [########............]")
        await sleep(0.5)
        await message.edit("ЗагрузОчка: 45% [#########...........]")
        await sleep(0.5)
        await message.edit("ЗагрузОчка: 50% [##########..........]")
        await sleep(0.5)
        await message.edit("ЗагрузОчка: 55% [###########.........]")
        await sleep(0.5)
        await message.edit("ЗагрузОчка: 60% [############........]")
        await sleep(0.5)
        await message.edit("ЗагрузОчка: 65% [#############.......]")
        await sleep(0.5)
        await message.edit("ЗагрузОчка: 70% [##############......]")
        await sleep(0.5)
        await message.edit("ЗагрузОчка: 75% [###############.....]")
        await sleep(0.5)
        await message.edit("ЗагрузОчка: 80% [################....]")
        await sleep(0.5)
        await message.edit("ЗагрузОчка: 85% [#################...]")
        await sleep(0.5)
        await message.edit("ЗагрузОчка: 90% [##################..]")
        await sleep(0.5)
        await message.edit("ЗагрузОчка: 95% [###################.]")
        await sleep(0.5)
        await message.edit("ЗагрузОчка: 100% [####################]")